Repository: GirfanovOV/tg-acc-bot
Catalog: acc_bot/po/*/LC_MESSAGES/bot.po
Languages: ru

source: restaurants
ru: рестораны

source: transport
ru: транспорт

source: supermarkets
ru: супермаркеты

source: pharmacy
ru: аптеки

source: entertainment
ru: развлечения

source: other
ru: другое

source: Sorry, I dont understand.
ru: Извините, я не понимаю.

source: I dont understand🧐
ru: Я не понимаю🧐

source: I dont understand!🤬
ru: Я не понимаю!🤬

source: STOP!✋
ru: ХВАТИТ!✋

source: Hey! Im an accountant bot. Ill help u managing ur finances!
ru: Привет! Я бот-бухгалтер. Я помогаю следить за финансами!

source: Unknown cmd 🥵
ru: Неизвестная команда

source: Wrong input
ru: Неверный ввод

source: Please, choose category:
ru: Пожалуйста выберете категорию

source: Type new limit
ru: Введите новый лимит

source: Type the amount spent
ru: Введите, сколько потрачено

source: Category {} was updated!
ru: Категория {} обновлена!

source: Youve exceeded your weekly limit for the category {} 😱
ru: Вы привысили ваш месячный предел для категории {} 😱

source: Youve already spent {} of you limit {} for this week
ru: Вы уже потратили {} из вашего лимита {} на этой неделе

source: Limit for {} category was updated!
ru: Лимит для {} категории был обновлен!

source: You havent spent any money this week 😢
ru: Вы еще не тратили деньги на этой неделе 😢

source: Wow!🤩 Heres your top spenings of this week:
ru: Вау!🤩 Вот ваши траты за эту неделю:

source: And the total is: {} moneys!💸
ru: И всего : {} денег!💸

source: Only {} category present
ru: Только {} категория! :(

source: Too few data 😔
ru: Слишком мало данных 😔

source: Your week totals:
ru: Ваши понедельные траты:

source: By the way, we predict you to spend {} next week!
ru: Кроме того, я думаю, вы потратите {} на следующей неделе!

source: This is a help message
ru: Справка :

source: /add - add spending for specific category.
ru: /add - добавить трату для конкретной категории.

source: /set_limit - set the limit for the category.
ru: /set_limit - установить лимит на категорию.

source: /week show stats for the last week.
ru: /week - проказать статистику по последней неделе.

source: /weeks show accumulated stats for the whole history.
ru: /weeks - показать статистику по всем неделям в истории.

source: Please, provide telegram-bot token or left blank to use default:
ru: Пожалуйста, укажите токен бота или оставьте поле пустым чтобы использовать значение по умолчанию:

source: The bot is ready!
ru: Бот готов к работе!
